-- =========================================
-- Задания на дом по SQL
-- Студент: Алямкин Артём Андреевич
-- Дата: 29.09.2026
-- =========================================

-- Задание 1. Самый дорогой товар
SELECT тип, цена FROM Товар ORDER BY цена DESC LIMIT 1;

-- Задание 2. Самый дешёвый товар
SELECT тип, цена FROM Товар ORDER BY цена ASC LIMIT 1;

-- Задание 3. Товары категории «X»
SELECT тип, цена FROM Товар WHERE тип = '2-комн.';

-- Задание 4. Поиск по названию
SELECT * FROM Товар WHERE тип LIKE '%о%';

-- Задание 5. Все заказы
SELECT id, дата, клиент, товар_id, количество FROM Заказ;

-- Задание 6. Заказы конкретного клиента
SELECT * FROM Заказ WHERE клиент = 'Иванов Иван Иванович';

-- Задание 7. JOIN — заказы с названиями товаров
SELECT Заказ.дата, Заказ.клиент, Товар.тип, Заказ.количество
FROM Заказ
JOIN Товар ON Заказ.товар_id = Товар.id;

-- Задание 8. Общая сумма всех заказов
SELECT SUM(Товар.цена * Заказ.количество) AS итоговая_сумма
FROM Заказ
JOIN Товар ON Заказ.товар_id = Товар.id;

-- Задание 9. Количество заказов по клиентам
SELECT клиент, COUNT(*) AS количество_заказов
FROM Заказ
GROUP BY клиент;

-- Задание 10. Мой запрос
-- Что хочу получить: вывод всех пользователей с ролями и упорядочить их
SELECT фио, логин, роль FROM Пользователь ORDER BY роль;
